test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         19010;

deltaT          0.05;

writeControl    runTime;

writeInterval   1900;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep	yes;

maxCo		0.4;

timeStart    #eval #{ 1.0/10.0 * ${/endTime} #};

functions
{

    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart	$/timeStart;

        fields
        (
		U
		{
			mean        on;
			prime2Mean  on;
			base        time;
		}

		p
		{
			mean        on;
			prime2Mean  on;
			base        time;
		}

		nut
		{
			mean        on;
			prime2Mean  off;
			base        time;
		}
	);
    }
}

// ************************************************************************* //
