test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2304;
        startFace       515712;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2304;
        startFace       518016;
    }
    sides1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       520320;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half1;
    }
    sides1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       522144;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides1_half0;
    }
    sides2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       523968;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half1;
    }
    sides2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       525792;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sides2_half0;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       527616;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half1;
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       529440;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half0;
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       531264;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half1;
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1824;
        startFace       533088;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half0;
    }
)

// ************************************************************************* //
